namespace Task14_02
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // Урок 14. Задание 2.

            // Разработайте программу для управления складом магазина электроники, используя коллекцию Dictionary<string, int>, где:
            //  Ключ — артикул товара(например, "A001")
            //  Значение — количество единиц товара на складе
            // Требования:
            //  Создайте словарь и добавьте в него 3 товара:
            //      Ноутбуки("A001") — 10 шт.
            //      Смартфоны("B205") — 25 шт.
            //      Наушники("C307") — 15 шт.
            //  Реализуйте следующие операции:
            //      Проверьте наличие товара с артикулом "B205"(ContainsKey).
            //      Обновите количество ноутбуков до 8(продали 2 шт.) через индексатор.
            //      Получите количество наушников безопасным способом(TryGetValue).
            //      Увеличьте количество смартфонов на 5(новый завоз).
            //      Удалите наушники из инвентаря(Remove).
            //  Выведите текущий инвентарь в формате:
            //      Артикул: A001, Количество: 8
            //      Артикул: B205, Количество: 30
            //  Проверьте, пуст ли словарь(Count), затем полностью очистите инвентарь(Clear).
            // Пример вывода:
            //  Есть ли товар с артикулом B205? True
            //  Количество наушников: 15
            //  Текущий инвентарь:  
            //  Артикул: A001, Количество: 8
            //  Артикул: B205, Количество: 30
            //  Инвентарь пуст? False
            //  Количество товаров после очистки: 0

            // Создаем словарь для управления складом магазина электроники
            Dictionary<string, int> goods = new Dictionary<string, int>();

            // Добавляем товары
            goods.Add("A001", 10);
            goods.Add("B205", 25);
            goods.Add("C307", 15);

            // Проверка наличия товара
            bool hasProduct = goods.ContainsKey("B205");
            Console.WriteLine($"Есть ли товар с артикулом B205? {hasProduct}");

            // Изменение значения количества ноутбуков
            goods["A001"] = 8;

            // Получаем количество наушников
            if (goods.TryGetValue("C307", out int headphonesAmount))
            {
                Console.WriteLine($"Количество наушников: {headphonesAmount}");
            }

            // Увеличиваем количество смартфонов
            goods["B205"] = 30;

            // Удаляем наушники из инвентаря
            goods.Remove("C307");

            // Выводим текущий инвентарь
            Console.WriteLine("Текущий инвентарь:");
            foreach (KeyValuePair<string, int> product in goods)
            {
                Console.WriteLine($"Артикул: {product.Key}, Количество: {product.Value}");
            }

            // Проверяем, пуст ли словарь
            bool isEmpty = goods.Count == 0;
            Console.WriteLine($"Инвентарь пуст? {isEmpty}");

            // Очищаем словарь
            goods.Clear();
            Console.WriteLine($"Количество товаров после очистки: {goods.Count}");

            Console.ReadKey();
        }
    }
}
