namespace Task14_01
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // Урок 14. Задание 1.

            // Разработайте программу для управления списком игроков команды, используя стандартные методы класса List<T>.
            // Требования:
            //  Создайте список для хранения фамилий игроков(тип string).
            //  Реализуйте следующие операции:
            //      Добавление игроков "Иванов", "Петров", "Сидоров" методом Add.
            //      Вставка игрока "Козлов" на позицию с индексом 1 методом Insert.
            //      Проверка наличия игрока "Петров" в команде методом Contains.
            //      Удаление игрока "Сидоров" методом Remove.
            //      Поиск индекса игрока "Козлов" методом IndexOf.
            //      Сортировка списка по алфавиту методом Sort.
            //      Выведите текущий состав команды в формате:
            //          1.Иванов
            //          2.Козлов
            //          3.Петров
            //      Проверьте, пуст ли список(свойство Count), и очистите его методом Clear.
            // Пример вывода:
            //  Есть ли игрок 'Петров' в команде? True
            //  Индекс игрока 'Козлов': 1
            //  Текущий состав команды:
            //      1.Иванов
            //      2.Козлов
            //      3.Петров
            //  Команда пуста? False
            //  Количество игроков после очистки: 0

            // Создаем список игроков
            List<string> players = new List<string>();

            // Добавляем игроков в список 
            players.Add("Иванов");
            players.Add("Петров");
            players.Add("Сидоров");

            // Добавляем игрока вставкой
            players.Insert(1, "Козлов");

            // Проверяем наличие игрока
            bool hasPlayer = players.Contains("Петров");
            Console.WriteLine($"Есть ли игрок 'Петров' в команде? {hasPlayer}");

            // Удаление игрока
            players.Remove("Сидоров");

            // Поиск индекса игрока
            int playerIndex = players.IndexOf("Козлов");
            Console.WriteLine($"Индекс игрока 'Козлов': {playerIndex}");

            // Сортируем список
            players.Sort();

            // Выводим состав команды
            Console.WriteLine("Текущий состав команды:");
            for (int i = 0; i < players.Count; i++)
            {
                Console.WriteLine($"{i + 1}.{players[i]}");
            }

            // Проверяем, пуст ли список
            bool isEmpty = players.Count == 0;
            Console.WriteLine($"Команда пуста? {isEmpty}");

            // Очищаем список
            players.Clear();

            // Проверяем количество игроков после очистки
            Console.WriteLine($"Количество игроков после очистки: {players.Count}");

            Console.ReadKey();
        }
    }
}
